"""
Пример использования генератора изображений Polza.AI
Цель: показать студентам, как пользоваться созданным модулем
ЗАЩИТА: Добавлен механизм предотвращения случайных повторных трат
"""

# Импортируем необходимые модули
import sys  # Для работы с путями к модулям
import os  # Для работы с файловой системой
import json # Для сохранения состояния
import datetime # Для работы с датой

# Добавляем путь к папке src, чтобы Python мог найти наш модуль
sys.path.insert(0, os.path.join(os.path.dirname(__file__), '..'))

# Импортируем наш класс генератора изображений
from src.image_generator import PolzaImageGenerator


def save_last_task(task_id):
    """Сохраняет ID последней задачи, чтобы можно было к ней вернуться"""
    with open('last_task.json', 'w') as f:
        json.dump({
            'task_id': task_id,
            'timestamp': datetime.datetime.now().isoformat()
        }, f)

def load_last_task():
    """Загружает ID последней задачи"""
    if os.path.exists('last_task.json'):
        try:
            with open('last_task.json', 'r') as f:
                return json.load(f)
        except:
            return None
    return None

def main():
    """
    Главная функция - демонстрирует полный цикл генерации изображения
    
    Цель: показать все этапы работы с API от запроса до скачивания
    Задачи:
    1. Создать экземпляр генератора
    2. Отправить запрос на генерацию
    3. Дождаться выполнения
    4. Скачать готовое изображение
    """
    
    # Выводим заголовок программы
    print("=" * 60)
    print("🎨 Генератор изображений Polza.AI - Учебный пример")
    print("=" * 60)
    print()
    
    try:
        # Шаг 1: Создаём экземпляр генератора (API ключ берётся из .env)
        print("📌 Шаг 1: Инициализация генератора")
        generator = PolzaImageGenerator()
        print("✅ Генератор инициализирован\n")
        
        # =================================================================================
        # 🛡️ ЗАЩИТА ОТ ФИНАНСОВЫХ ПОТЕРЬ
        # =================================================================================
        last_task = load_last_task()
        task_id = None
        
        if last_task:
            print(f"⚠️ Найдена предыдущая задача: {last_task.get('task_id')}")
            print(f"🕒 Создана: {last_task.get('timestamp')}")
            user_choice = input("Хотите продолжить ожидание этой задачи вместо создания новой? (y/n): ").lower()
            
            if user_choice == 'y':
                task_id = last_task.get('task_id')
                print(f"♻️ Восстанавливаем задачу ID: {task_id}")
            else:
                print("💰 Будет создана НОВАЯ задача (списание средств!)")
        
        # Если задачу не восстановили, создаем новую
        if not task_id:
            # Шаг 2: Задаём промпт - описание того, что хотим нарисовать
            print("📌 Шаг 2: Создание задачи генерации")
            
            prompt = "Festive New Year community gathering illustration, neighbors celebrating together in apartment building courtyard, ice skating rink with bublik tubes, warm lights, Christmas decorations, friendly atmosphere, cozy winter evening, digital art, vibrant colors, detailed, heartwarming scene"
            print(f"Промпт: {prompt}\n")
            
            # ⚠️ ПОДТВЕРЖДЕНИЕ ПЕРЕД СПИСАНИЕМ
            confirm = input("Вы подтверждаете создание новой генерации (списание средств)? (y/n): ")
            if confirm.lower() != 'y':
                print("❌ Отмена операции пользователем.")
                return

            # Отправляем запрос на генерацию
            result = generator.generate_image(
                prompt=prompt,
                model="gemini-3-pro-image-preview", # Если зависает - попробуйте "flux-pro-1.1"
                width=1024,
                height=1024
            )
            
            # Извлекаем ID задачи
            task_id = result.get('requestId') or result.get('id') or result.get('task_id')
            print(f"ID задачи: {task_id}\n")
            
            # Сохраняем ID задачи
            if task_id:
                save_last_task(task_id)
        
        # Если ID не найден - прекращаем выполнение
        if not task_id:
            print("❌ Не удалось получить ID задачи из ответа API")
            return
        
        # Шаг 3: Ожидаем завершения генерации (Таймаут увеличен до 10 минут)
        print("📌 Шаг 3: Ожидание завершения генерации (до 10 мин)")
        final_result = generator.wait_for_image(
            task_id=task_id,
            max_wait=600,  # 600 секунд = 10 минут
            check_interval=5
        )
        print()
        
        # Шаг 4: Извлекаем URL готового изображения из ответа
        print("📌 Шаг 4: Скачивание изображения")
        print(f"🔍 Финальный ответ API: {final_result}")
        
        image_url = None
        
        # Приоритет 1: Поле output (как в документации)
        if 'output' in final_result:
            output = final_result.get('output')
            if isinstance(output, list) and len(output) > 0:
                image_url = output[0]
            elif isinstance(output, str):
                image_url = output
        
        # Приоритет 2: Поле data (альтернативный формат)
        elif 'data' in final_result and isinstance(final_result['data'], list) and len(final_result['data']) > 0:
            item = final_result['data'][0]
            image_url = item.get('url') or item.get('image_url')
            
        # Приоритет 3: URL прямо в корне
        elif 'url' in final_result:
            image_url = final_result.get('url')
        
        # Проверяем, что URL найден
        if not image_url:
            print("❌ Не удалось найти URL изображения в ответе API")
            return
        
        # Формируем путь для сохранения: output/generated_<task_id>.png
        safe_task_id = str(task_id).replace(':', '_').replace('/', '_')
        save_path = os.path.join('output', f'generated_{safe_task_id}.png')
        
        # Скачиваем изображение
        saved_file = generator.download_image(image_url, save_path)
        print()
        
        # Выводим итоговое сообщение об успехе
        print("=" * 60)
        print("✅ Успех! Изображение сгенерировано и сохранено")
        print(f"📁 Файл: {saved_file}")
        print("=" * 60)
        
        # Если всё успешно - удаляем запись о последней задаче
        if os.path.exists('last_task.json'):
            os.remove('last_task.json')
        
    except ValueError as e:
        print(f"❌ Ошибка конфигурации: {e}")
        print("💡 Проверьте файл .env - там должен быть ваш API ключ")
        
    except TimeoutError as e:
        print(f"❌ Превышено время ожидания: {e}")
        print("💡 Задача все еще выполняется на сервере.")
        print("💡 Запустите скрипт снова и выберите 'y' для продолжения ожидания этой же задачи.")
        
    except Exception as e:
        print(f"❌ Произошла ошибка: {e}")
        print("💡 Проверьте подключение к интернету и правильность API ключа")


# Точка входа в программу
if __name__ == "__main__":
    main()
